## Introduction à Pandas

Pandas est une librairie Python spécialisée dans l’analyse des données. Il nous permet de faire des opérations efficaces sur des données sous forme de tableaux multidimensionnels homogènes.

In [2]:
import numpy as np
import pandas as pd

### Series
Series  de Pandas est une généralisation d'un ndarray de NumPy d'une seule dimension. Sa particularité est que les valeurs sont indexées.

In [3]:
x = np.random.random(4)
x

array([0.25053352, 0.32013075, 0.67959345, 0.33798491])

In [4]:
x = pd.Series(x)
x

0    0.250534
1    0.320131
2    0.679593
3    0.337985
dtype: float64

In [5]:
x[0]

np.float64(0.2505335156071452)

Les index peuvent être non numériques.

In [6]:
si = pd.Series([210, 31, 40, 15],index =['Porcupine','Chipmunk','Squirrel','Goat'])
si

Porcupine    210
Chipmunk      31
Squirrel      40
Goat          15
dtype: int64

In [7]:
si['Porcupine']

np.int64(210)

In [8]:
si[0] #mais cette façon d'indexer reste toujours valide

C:\Users\randy\AppData\Local\Temp\ipykernel_31232\3524060303.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  si[0] #mais cette façon d'indexer reste toujours valide

np.int64(210)

Series a tous les avantages donnés par ndarray de Numpy.

### Structure DataFrame
DataFrame est celui qui nous intéresse le plus dans la librairie Pandas. Une matrice DataFrame correspond à une matrice individus-variables où les lignes correspondent à des observations, les
colonnes à des attributs décrivant les individus. Chaque colonne est de type Series.

On peut créer un DataFrame de plusieurs façons:
- à partir d'un fichier ( texte, csv, excel , ...)
- à partir d'un dictionnaire, liste ou tuples
- à partir de Series de Pandas, array de Numpy

In [9]:
import numpy as np
import pandas as pd
#la création manuelle d'un dataframe qui passe par un dictionnaire
data = {
    'city': [ 'Boston', 'Paris', 'Lagos' ],
    'area': [ 11700, 17174, 2706],
    'population': [4628910, 12405426, 21000000]
}
frame = pd.DataFrame(data)
print(frame)
#la creation manuelle d'un DataFrame qui passe par Numpy 
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),columns=['col1', 'col2', 'col3'])
df2

     city   area  population
0  Boston  11700     4628910
1   Paris  17174    12405426
2   Lagos   2706    21000000

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

Quelques opérations élémentaires sur un DataFrame

In [10]:
print(frame.columns) #permet d'avoir les columns de frame
type(frame.columns)

Index(['city', 'area', 'population'], dtype='object')

pandas.core.indexes.base.Index

In [11]:
frame.city #equivalent à frame['city'], permet de prendre la colonne entière city

0    Boston
1     Paris
2     Lagos
Name: city, dtype: object

In [12]:
frame.loc[0] #get row with index 0

city           Boston
area            11700
population    4628910
Name: 0, dtype: object

In [13]:
frame.loc[0:2]['city'] #combinaison des deux avec un bonus slicing

0    Boston
1     Paris
2     Lagos
Name: city, dtype: object

In [14]:
frame.population.max() #population maximale
frame[frame.population == frame.population.max()].city #le city ayant la population maximale

2    Lagos
Name: city, dtype: object

In [15]:
frame

     city   area  population
0  Boston  11700     4628910
1   Paris  17174    12405426
2   Lagos   2706    21000000

In [16]:
frame.loc[0,'population']=21000000 #modification de valeurs

In [17]:
frame

     city   area  population
0  Boston  11700    21000000
1   Paris  17174    12405426
2   Lagos   2706    21000000

In [18]:
frame[['city','area']] #pour prendre deux colonnes

     city   area
0  Boston  11700
1   Paris  17174
2   Lagos   2706

In [19]:
frame.loc[0:2][['city','area']] #combinaison

     city   area
0  Boston  11700
1   Paris  17174
2   Lagos   2706

select city,population from frame

In [20]:
frame[['city','area']].loc[0:2] #même resultat que ci-dessus

     city   area
0  Boston  11700
1   Paris  17174
2   Lagos   2706

## Ajouter une ligne dans un DataFrame

In [21]:
dfTemp = pd.DataFrame({'city':['Kiev'],'area': [110000],'population':[1075000]})

In [22]:
frame = pd.concat([frame,dfTemp],ignore_index=True)

In [23]:
frame

     city    area  population
0  Boston   11700    21000000
1   Paris   17174    12405426
2   Lagos    2706    21000000
3    Kiev  110000     1075000

On peut effacer un enregistrement en indiquant les lignes à effacer, on utilise la méthode drop. Attention la fonction drop ne modifie pas directement l'objet dataFrame mais elle renvoie un nouvel objet dataFrame avec l'élément éffacé.

In [24]:
frame

     city    area  population
0  Boston   11700    21000000
1   Paris   17174    12405426
2   Lagos    2706    21000000
3    Kiev  110000     1075000

## Ajouter une colonne

In [25]:
dfTemp2 = pd.DataFrame({'country':[]})

In [26]:
frame= pd.concat([frame,dfTemp2],ignore_index=True)

## Effacer ligne ou colonne

In [27]:
frame.drop([1], axis=0) #attention ceci n'affecte pas frame mais renvoie un nouveau Dataframe

     city      area  population  country
0  Boston   11700.0  21000000.0      NaN
2   Lagos    2706.0  21000000.0      NaN
3    Kiev  110000.0   1075000.0      NaN

In [28]:
frame.drop(['city'], axis=1)

       area  population  country
0   11700.0  21000000.0      NaN
1   17174.0  12405426.0      NaN
2    2706.0  21000000.0      NaN
3  110000.0   1075000.0      NaN

### Equivalence SQL, DataFrame

DataFrame est en quelques sortes un SGBD comme Mysql. Les requetes SQL ont des équivalences en DataFrame.
Par exemple , soit la requete SQL suivant :

SELECT city FROM frame where population>=4000000

Son équivalence en DataFrame est

In [29]:
frame[frame['population']>4000000]['city']

0    Boston
1     Paris
2     Lagos
Name: city, dtype: object

Par exemple aussi:
    
SELECT city,area FROM frame where population>=4000000

In [30]:
frame[frame['population']>=4000000][['city','area']]

     city     area
0  Boston  11700.0
1   Paris  17174.0
2   Lagos   2706.0

Ou encore:

SELECT city,area FROM frame where population>=4000000 limit 1

In [31]:
frame[frame['population']>=4000000][['city','area']][0:1]

     city     area
0  Boston  11700.0

ou encore

SELECT count(*) FROM frame

In [32]:
frame.shape[0]

4

ou encore

SELECT sum(population) FROM frame

In [33]:
frame['population'].sum()

np.float64(55480426.0)

ou encore 

SELECT * from frame where country IS NULL

In [34]:
frame.loc[frame['country'].isna()]

     city      area  population  country
0  Boston   11700.0  21000000.0      NaN
1   Paris   17174.0  12405426.0      NaN
2   Lagos    2706.0  21000000.0      NaN
3    Kiev  110000.0   1075000.0      NaN

ou encore 

UPDATE frame SET  country = 'mada'
WHERE country is NULL

In [35]:
frame['country']= frame['country'].fillna("mada")

In [36]:
frame

     city      area  population country
0  Boston   11700.0  21000000.0    mada
1   Paris   17174.0  12405426.0    mada
2   Lagos    2706.0  21000000.0    mada
3    Kiev  110000.0   1075000.0    mada

### Exercices
Faire les equivalences des requetes suivantes

1) `SELECT * from frame where area is not null`

In [37]:
frame[frame['country'].isna()]

Empty DataFrame
Columns: [city, area, population, country]
Index: []

2) `SELECT city, country from frame where population>2000000`

In [38]:
frame[frame['population']>2000000][['city','country']]

     city country
0  Boston    mada
1   Paris    mada
2   Lagos    mada

3) `Delete from frame where city='Lagos'`

In [39]:
frame.drop(frame[frame['city'] == 'Lagos'].index, inplace=True)
frame

     city      area  population country
0  Boston   11700.0  21000000.0    mada
1   Paris   17174.0  12405426.0    mada
3    Kiev  110000.0   1075000.0    mada

4) `Insert into frame(city,population,population) values('tana',5000000,'Mada')`

In [40]:
data = pd.DataFrame([{'city': 'tana', 'population': 21000000, 'country': 'mada'}])
frame = pd.concat([frame,data], ignore_index=True)
print(frame)

     city      area  population country
0  Boston   11700.0  21000000.0    mada
1   Paris   17174.0  12405426.0    mada
2    Kiev  110000.0   1075000.0    mada
3    tana       NaN  21000000.0    mada

5) `select city from frame where city like %o%`

In [41]:

frame[frame['city'].str.contains('o')]['city']

0    Boston
Name: city, dtype: object

6) `select * from frame where population>10000000 and area>4000`

In [42]:
frame[(frame['population'] >10000000) & (frame['area'] >4000)]

     city     area  population country
0  Boston  11700.0  21000000.0    mada
1   Paris  17174.0  12405426.0    mada

7) select city from frame order by population,city

In [43]:
# help(pd.DataFrame.sort_values)
frame.sort_values(by=['population', 'city'], ascending=False)

     city      area  population country
3    tana       NaN  21000000.0    mada
0  Boston   11700.0  21000000.0    mada
1   Paris   17174.0  12405426.0    mada
2    Kiev  110000.0   1075000.0    mada

8) select country,sum(population) from city group by country

In [44]:
# frame['country', 'city']

print(frame)
data_s = frame.groupby(frame['country'] , as_index=False)
data_s.sum()[['country','population']]

     city      area  population country
0  Boston   11700.0  21000000.0    mada
1   Paris   17174.0  12405426.0    mada
2    Kiev  110000.0   1075000.0    mada
3    tana       NaN  21000000.0    mada

  country  population
0    mada  55480426.0

### Lecture de fichier avec pandas

On peut lire un fichier texte brute, csv et excel en utilisant respectivement les fonctions
pd.read_table, pd.read_csv, pd.read_excel.

In [45]:
%pip install xlrd>=2.0.1

Note: you may need to restart the kernel to use updated packages.

In [48]:
data_csv = pd.read_csv('5_pays.csv', sep=';', encoding='utf-8', decimal=',')
data_text = pd.read_table('note.txt')
data_excel = pd.read_excel('5_titanic.xlsx')
# print(data_csv)
# print(data_text)
print(data_excel)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]